Repository: Ars-Linguistica/mlconjug3
Catalog: docs/locale/*/LC_MESSAGES/contributing.po
Languages: pt

source: Contributing
pt: Contribuindo

source: Contributions are welcome, and they are greatly appreciated! Every little bit helps, and credit will always be given.
pt: Contribuições são bem-vindas, e são muito apreciadas! Cada pequena ajuda, e crédito sempre será dado.

source: You can contribute in many ways:
pt: Você pode contribuir de várias maneiras:

source: Types of Contributions
pt: Tipos de Contribuições

source: Report Bugs
pt: Reportar erros

source: Report bugs at https://github.com/SekouD/mlconjug/issues.
pt: Reportar bugs em https://github.com/SekouD/mlconjug/issues.

source: If you are reporting a bug, please include:
pt: Se você está relatando um bug, por favor inclua:

source: Your operating system name and version.
pt: O nome e a versão do seu sistema operacional.

source: Any details about your local setup that might be helpful in troubleshooting.
pt: Quaisquer detalhes sobre sua configuração local que possam ser úteis na solução de problemas.

source: Detailed steps to reproduce the bug.
pt: Etapas detalhadas para reproduzir o bug.

source: Fix Bugs
pt: Corrigir erros

source: Look through the GitHub issues for bugs. Anything tagged with "bug" and "help wanted" is open to whoever wants to implement it.
pt: Olhe através dos problemas do GitHub para erros. Qualquer coisa marcada com " bug \ "e " help wanted \ "está aberta para quem quiser implementá-lo.

source: Implement Features
pt: Implementar recursos

source: Look through the GitHub issues for features. Anything tagged with "enhancement" and "help wanted" is open to whoever wants to implement it.
pt: Examine os problemas do GitHub para recursos. Qualquer coisa marcada com " aprimoramento \ "e " ajuda desejada \ "está aberta a quem quiser implementá-la.

source: MLConjug could always use more documentation, whether as part of the official MLConjug docs, in docstrings, or even on the web in blog posts, articles, and such.
pt: O MLConjug poderia sempre usar mais documentação, seja como parte dos documentos oficiais do MLConjug, em docstrings, ou mesmo na web, em posts de blogs, artigos e outros.

source: Submit Feedback
pt: Enviar feedback

source: The best way to send feedback is to file an issue at https://github.com/SekouD/mlconjug/issues.
pt: A melhor maneira de enviar feedback é enviar um problema para https://github.com/SekouD/mlconjug/issues.

source: If you are proposing a feature:
pt: Se você está propondo um recurso:

source: Explain in detail how it would work.
pt: Explique em detalhes como isso funcionaria.

source: Keep the scope as narrow as possible, to make it easier to implement.
pt: Mantenha o escopo o mais estreito possível, para facilitar a implementação.

source: Remember that this is a volunteer-driven project, and that contributions are welcome :)
pt: Lembre-se que este é um projeto dirigido por voluntários e que as contribuições são bem-vindas :)

source: Get Started!
pt: Iniciar!

source: Ready to contribute? Here's how to set up `mlconjug` for local development.
pt: Pronto para contribuir? Veja como configurar o 'mlconjug' para desenvolvimento local.

source: Fork the `mlconjug` repo on GitHub.
pt: Empurre o repositório` mlconjug` no GitHub.

source: Clone your fork locally::
pt: Clone seu garfo localmente

source: Install your local copy into a virtualenv. Assuming you have virtualenvwrapper installed, this is how you set up your fork for local development::
pt: Instale sua cópia local em um virtualenv. Assumindo que você tenha o virtualenvwrapper instalado, é assim que você configura seu fork para o desenvolvimento local:

source: Create a branch for local development::
pt: Criar uma filial para desenvolvimento local ::

source: Now you can make your changes locally.
pt: Agora você pode fazer suas alterações localmente.

source: When you're done making changes, check that your changes pass flake8 and the tests, including testing other Python versions with tox::
pt: Quando você terminar de fazer alterações, verifique se suas alterações passam no flake8 e nos testes, incluindo testes de outras versões do Python com o tox ::

source: To get flake8 and tox, just pip install them into your virtualenv.
pt: Para obter o flake8 e o tox, basta instalá-los em seu virtualenv"

source: Commit your changes and push your branch to GitHub::
pt: Confirme suas alterações e envie sua ramificação para o GitHub ::

source: Submit a pull request through the GitHub website.
pt: Envie uma solicitação pull através do site do GitHub.

source: Pull Request Guidelines
pt: Diretrizes de solicitação pull

source: Before you submit a pull request, check that it meets these guidelines:
pt: Antes de enviar uma solicitação de recebimento, verifique se ela atende a estas diretrizes:

source: The pull request should include tests.
pt: O pedido pull deve incluir testes.

source: If the pull request adds functionality, the docs should be updated. Put your new functionality into a function with a docstring, and add the feature to the list in README.rst.
pt: Se a solicitação pull adiciona funcionalidade, os documentos devem ser atualizados. Coloque sua nova funcionalidade em uma função com uma docstring e adicione o recurso à lista em README.rst.

source: Tips
pt: Dicas

source: To run a subset of tests::
pt: Para executar um subconjunto de testes ::
