Repository: Ars-Linguistica/mlconjug3
Catalog: docs/locale/*/LC_MESSAGES/modules.po
Languages: es, fr, it, pt, ro

source: Package Api Documentation for mlconjug
fr: Package Api Documentation pour mlconjug
it: Documentazione pacchetto API per mlconjug

source: API Reference for the classes in mlconjug.mlconjug.py
es: Referencia de API para las clases en mlconjug.mlconjug.py
fr: Référence de l'API pour les classes dans mlconjug.mlconjug.py
it: Riferimento API per le classi in mlconjug.mlconjug.py
pt: Referência de API para as classes em mlconjug.mlconjug.py
ro: Referință API pentru clasele din mlconjug.mlconjug.py

source: MLConjug Main module.
es: Bases:: clase:` objeto`
fr: MLConjug Module principal.
it: Modulo MLConjug Main.
pt: Módulo principal do MLConjug.
ro: Modul principal MLConjug.

source: This module declares the main classes the user interacts with.
fr: Ce module déclare les classes principales avec lesquelles l'utilisateur interagit.
it: Questo modulo dichiara le classi principali con cui l'utente interagisce.
pt: Este módulo declara as principais classes com as quais o usuário interage.
ro: Acest modul declară clasele principale cu care interacționează utilizatorul.

source: The module defines the classes needed to interface with Machine Learning models.
fr: Le module définit les classes nécessaires à l'interface avec les modèles Machine Learning.
it: Il modulo definisce le classi necessarie per interfacciarsi con i modelli Machine Learning.
pt: O módulo define as classes necessárias para interagir com os modelos de Machine Learning.
ro: Modulul definește clasele necesare pentru a interconecta cu modelele Machine Learning.

source: Bases: :class:`object`
fr: Bases:: class:` objet`
it: Basi:: classe:` oggetto`
pt: Bases:: class:` objeto`
ro: Bazele:: clasa:` obiect`

source: This is the main class of the project.
es: Parámetros
fr: C'est la classe principale du projet.
it: Questa è la classe principale del progetto.
pt: Esta é a principal classe do projeto.
ro: Aceasta este clasa principală a proiectului.

source: The class manages the Verbiste data set and provides an interface with the scikit-learn model.
fr: La classe gère l'ensemble de données Verbiste et fournit une interface avec le modèle scikit-learn.
it: Se non vengono forniti parametri, la lingua predefinita è impostata su francese e viene utilizzato il modello di coniugazione francese pre-addestrato.
pt: A classe gerencia o conjunto de dados Verbiste e fornece uma interface com o modelo scikit-learn.
ro: Dacă nu sunt furnizați parametri, limba prestabilită este setată la limba franceză și se folosește modelul de conjugare franceză pre-instruit.

source: If no parameters are provided, the default language is set to french and the pre-trained french conjugation model is used.
fr: Si aucun paramètre n'est fourni, la langue par défaut est le français et le modèle de conjugaison français pré-entraîné est utilisé.
pt: Se nenhum parâmetro for fornecido, o idioma padrão é definido para francês e o modelo de conjugação francês pré-treinado é usado.

source: The class defines the method conjugate(verb, language) which is the main method of the module.
fr: La classe définit la méthode conjuguée (verbe, langage) qui est la méthode principale du module.
it: La classe definisce il metodo conjugate (verb, language) che è il metodo principale del modulo.
pt: A classe define o método conjugado (verbo, idioma) que é o método principal do módulo.
ro: Clasa definește metoda conjugată (verb, limbă) care este principala metodă a modulului.

source: Parameters
fr: Paramètres
it: Parametri
pt: Parâmetros
ro: Limbajul conjugatorului. Limba implicită este" fr "pentru franceză.

source: string. Language of the conjugator. The default language is 'fr' for french.
es: cadena. Idioma del conjugador. El idioma predeterminado es 'fr' para francés.
fr: string.Langue du conjugateur.La langue par défaut est 'fr' pour le français.
it: string. Lingua del coniugatore. La lingua predefinita è" fr "per il francese.
pt: string. Linguagem do conjugador. O idioma padrão é 'fr' para francês.

source: string. A user provided model if the user has trained his own model.
es: Si no es así, y se ha proporcionado un modelo de aprendizaje de scikit preentrenado, el método llama al modelo
fr: chaîne.Un modèle fourni par l'utilisateur si l'utilisateur a formé son propre modèle.
it: Questo è il metodo principale di questa classe.
pt: string. Um usuário forneceu o modelo se o usuário treinou seu próprio modelo.
ro: șir. Un model furnizat de utilizator în cazul în care utilizatorul și-a pregătit propriul model.

source: This is the main method of this class.
fr: C'est la méthode principale de cette classe.
pt: Este é o principal método desta classe.
ro: Aceasta este principala metodă a acestei clase.

source: It first checks to see if the verb is in Verbiste.
fr: Il vérifie d'abord si le verbe est dans Verbiste.
it: Prima controlla se il verbo è in Verbiste.
pt: Primeiro, verifica se o verbo está em Verbiste.
ro: Dacă nu este, și a fost furnizat un model de scikit-learning pre-instruit, metoda mai apoi solicită modelul

source: If it is not, and a pre-trained scikit-learn model has been supplied, the method then calls the model
fr: Si ce n'est pas le cas, et qu'un modèle de scikit-learn pré-formé a été fourni, la méthode appelle alors le modèle
it: Se non lo è, ed è stato fornito un modello di apprendimento scikit pre-addestrato, il metodo chiama il modello
pt: Se não for, e um modelo de aprendizado de scik pré-treinado foi fornecido, o método então chama o modelo

source: to predict the conjugation class of the provided verb.
es: cadena. Alterna los pronombres abreviados o completos. El valor predeterminado es 'abreviación'. Seleccione 'pronombre' para los pronombres completos.
fr: pour prédire la classe de conjugaison du verbe fourni.
it: Restituisce un oggetto Verb o None.
pt: predizer a classe de conjugação do verbo provido.
ro: Returnează un obiect Verb sau Nici unul.

source: Returns a Verb object or None.
fr: Renvoie un objet Verbe ou Aucun.
pt: Retorna um objeto Verbo ou Nenhum.

source: string. Verb to conjugate.
fr: Chaîne. Verbe à conjuguer.
it: string Attiva i pronomi abbreviati o pieni Il valore predefinito è" abbrev "Seleziona" pronome "per i pronomi completi.
pt: string. Verb para conjugar.
ro: șir. Verbul să conjugați.

source: string. Toggles abbreviated or full pronouns. The default value is 'abbrev'. Select 'pronoun' for full pronouns.
fr: chaîne de caractères: bascule les pronoms abrégés ou pleins La valeur par défaut est 'abbrev' Sélectionnez 'pronom' pour les pronoms complets.
pt: string. Alterna os pronomes abreviados ou completos. O valor padrão é 'abrev'. Selecione 'pronome' para os pronomes completos.
ro: Se intoarce

source: Returns
es: Devoluciones
fr: Résultats
it: Ritorna
pt: Retorna

source: Verb object or None.
es: Bases:: clase:` sklearn.feature_extraction.text.CountVectorizer`
fr: Objet de verbe ou Aucun.
it: Oggetto Verb o None.
pt: Objeto Verbo ou Nenhum.
ro: Obiect Verb sau Niciunul.

source: Assigns the provided pre-trained scikit-learn model to be able to conjugate unknown verbs.
fr: Attribue le modèle scikit-learn pré-formé fourni pour pouvoir conjuguer des verbes inconnus.
it: Assegna il modello pre-addestrato fornito di scikit per imparare a coniugare verbi sconosciuti.
pt: Atribui o modelo scikit-learn pré-treinado fornecido para ser capaz de conjugar verbos desconhecidos.
ro: Atribuie modelul Scikit-Learn pre-instruit furnizat pentru a putea conjuga verbe necunoscute.

source: scikit-learn Classifier or Pipeline.
fr: scikit-learn Classificateur ou Pipeline.
it: Scikit-learn Classifier o Pipeline.
pt: Classificador ou Pipeline do scikit-learn.
ro: Bazele:: clasa:" sklearn.feature_extraction.text.CountVectorizer`

source: Custom Vectorizer optimized for extracting verbs features.
es: Como en los idiomas indoeuropeos, los verbos se flexionan agregando un sufijo morfológico
fr: Custom Vectorizer optimisé pour extraire les fonctionnalités des verbes.
it: Vectorizer personalizzato ottimizzato per l'estrazione delle funzionalità dei verbi.
pt: Custom Vectorizer otimizado para extrair recursos de verbos.
ro: Vectorizatorul personalizat optimizat pentru extragerea caracteristicilor verbelor.

source: The Vectorizer subclasses sklearn.feature_extraction.text.CountVectorizer .
fr: Les sous-classes de Vectorizer sklearn.feature_extraction.text.CountVectorizer.
it: Le sottoclassi di Vectorizer sklearn.feature_extraction.text.CountVectorizer.
pt: O vetorizador subclasse sklearn.feature_extraction.text.CountVectorizer.
ro: Subclasele Vectorizer sklearn.feature_extraction.text.CountVectorizer.

source: As in Indo-European languages verbs are inflected by adding a morphological suffix,
fr: Comme dans les langues indo-européennes, les verbes sont infléchis en ajoutant un suffixe morphologique
it: Come nelle lingue indoeuropee i verbi sono flessi aggiungendo un suffisso morfologico,
pt: Como nas línguas indo-européias, os verbos são flexionados pela adição de um sufixo morfológico
ro: Ca și în limbile indo-europene, verbul este influențat prin adăugarea unui sufix morfologic

source: the vectorizer extracts verb endings and produces a vector representation of the verb with binary features.
es: Las características son los ngrams de finalización del verbo. (Ngram_range se establece en la creación de instancias de clases).
fr: Le vectorizer extrait les terminaisons verbales et produit une représentation vectorielle du verbe avec des caractéristiques binaires.
it: il vettore estrae le desinenze dei verbi e produce una rappresentazione vettoriale del verbo con caratteristiche binarie.
pt: o vetorizador extrai terminações verbais e produz uma representação vetorial do verbo com características binárias.
ro: Caracteristicile sunt verbul care sfârșește ngrams (ngram_range este setat la instanța de clasă).

source: The features are the verb ending ngrams. (ngram_range is set at class instanciation).
fr: Les caractéristiques sont la terminaison verbale ngrams. (Ngram_range est défini à l'instanciation de la classe).
it: Le caratteristiche sono i verbo che terminano ngrams. (Ngram_range è impostato all'istanza della classe).
pt: Os recursos são os diagramas de término de verbos. (Ngram_range é definido na instanciação de classe).

source: Parses a verb and returns the ending n-grams.
es: flotación. Proporción de muestras en el conjunto de entrenamiento. Debe estar entre 0 y 1.
fr: Analyse un verbe et renvoie les n-grammes de fin.
it: Analizza un verbo e restituisce il finale n-grammi.
pt: Analisa um verbo e retorna o final n-grams.
ro: Parsează un verb și returnează n-gramele care se termină.

source: string. Verb to vectorize.
fr: Chaîne. Verbe à vectoriser.
it: Questa classe contiene e gestisce il set di dati.
pt: string. Verb para vetorizar.
ro: șir. Verb să vectorizeze.

source: list. Final n-grams of the verb.
fr: liste.N-grammes finaux du verbe.
pt: lista. n-gramas finais do verbo.
ro: n-grame finale ale verbului.

source: This class holds and manages the data set.
fr: Cette classe contient et gère l'ensemble de données.
pt: Esta classe mantém e gerencia o conjunto de dados.
ro: Această clasă deține și gestionează setul de date.

source: Defines helper functions for managing Machine Learning tasks like constructing a training and testing set.
fr: Définit les fonctions d'assistance pour la gestion des tâches d'apprentissage automatique, telles que la construction d'un ensemble d'entraînement et de test.
it: Definisce le funzioni di supporto per la gestione delle attività di Machine Learning come la costruzione di un set di training e test.
pt: Define funções auxiliares para gerenciar tarefas de Aprendizado de Máquina, como a construção de um conjunto de treinamento e testes.
ro: Definește funcțiile de ajutor pentru gestionarea sarcinilor de învățare a mașinilor, cum ar fi construirea unui set de instruire și testare.

source: Instance of a Verbiste object.
fr: Instance d'un objet Verbiste.
it: Istanza di un oggetto Verbiste.
pt: Instância de um objeto Verbiste.
ro: Populează dicționarul care conține șabloanele de conjugare.

source: Populates the dictionary containing the conjugation templates.
fr: Remplit le dictionnaire contenant les modèles de conjugaison.
it: Compila il dizionario contenente i modelli di coniugazione.
pt: Popula o dicionário que contém os modelos de conjugação.

source: Populates the lists containing the verbs and their templates.
fr: Remplit les listes contenant les verbes et leurs modèles.
it: Compila gli elenchi contenenti i verbi e i loro modelli.
pt: Popula as listas contendo os verbos e seus modelos.
ro: Împărțiți datele într-un antrenament și un set de testare.

source: Splits the data into a training and a testing set.
fr: Divise les données en un ensemble de formation et de test.
it: Divide i dati in una formazione e un set di test.
pt: Divide os dados em um treinamento e um conjunto de testes.

source: int. Minimum size of conjugation class to be split.
fr: int. Taille minimale de la classe de conjugaison à diviser.
it: float. Proporzione di campioni nel set di allenamento. Deve essere compresa tra 0 e 1.
pt: int. Tamanho mínimo da classe de conjugação a ser dividida.
ro: int Dimensiunea minimă a clasei de conjugare care trebuie divizată.

source: float. Proportion of samples in the training set. Must be between 0 and 1.
fr: float.Proportion d'échantillons dans l'ensemble d'entraînement.Doit être compris entre 0 et 1.
pt: float. Proporção de amostras no conjunto de treino. Deve estar entre 0 e 1.
ro: float" Proporția probelor din setul de antrenament trebuie să fie între 0 și 1.

source: This class manages the scikit-learn model.
es: Si alguno de los vectorizadores, selectores de funciones o clasificadores no se entregan en la declaración de instancias
fr: Cette classe gère le modèle scikit-learn.
it: La pipeline include un vettore di funzionalità, un selettore di funzionalità e un classificatore.
pt: Esta classe gerencia o modelo de aprendizado de scikit.
ro: Această clasă gestionează modelul scikit-learn.

source: The Pipeline includes a feature vectorizer, a feature selector and a classifier.
fr: Le Pipeline comprend un vectorizer de caractéristiques, un sélecteur de caractéristiques et un classificateur.
pt: O Pipeline inclui um vetorizador de recursos, um seletor de recursos e um classificador.
ro: Conducta include un vectorizator de caracteristici, un selector de caracteristici și un clasificator.

source: If any of the vectorizer, feature selector or classifier is not supplied at instance declaration,
fr: Si l'un des vectorizer, sélecteur de fonctions ou classificateur n'est pas fourni à la déclaration d'instance,
it: Se uno dei vettori, selettore di funzionalità o classificatore non viene fornito nella dichiarazione di istanza,
pt: Se algum vetorizador, seletor de recurso ou classificador não for fornecido na declaração de instância,
ro: Dacă oricare dintre vectorizatorul, selectorul de caracteristici sau clasificatorul nu este furnizat la declarația instanței,

source: the __init__ method will provide good default values that get more than 92% prediction accuracy.
es: clasificador scikit-learn con un método fit_transform ()
fr: La méthode __init__ fournira de bonnes valeurs par défaut qui obtiennent plus de 92% de précision de prédiction.
it: Il metodo __init__ fornirà buoni valori predefiniti che ottengono più del 92% di accuratezza di previsione.
pt: o método __init__ fornecerá bons valores padrão que obtêm mais de 92% de precisão de previsão.
ro: metoda __init__ va oferi valori implicite bune care obțin precizie de prezență mai mare de 92%.

source: scikit-learn Vectorizer.
fr: Scikit-apprendre Vectorizer.
ro: clasificator scikit-learn cu o metodă fit_transform ()

source: scikit-learn Classifier with a fit_transform() method
fr: scikit-learn Classifier avec une méthode fit_transform ()
it: Scikit-learn Classifier con un metodo fit_transform ()
pt: classificador scikit-learn com um método fit_transform ()

source: scikit-learn Classifier with a predict() method
es: clasificador scikit-learn con un método de predicción ()
fr: scikit-learn Classifier avec une méthode predict ()
it: Scikit-learn Classifier con un metodo di previsione ()
pt: classificador scikit-learn com um método predict ()
ro: clasificator Scikit-learn cu o metodă predictivă ()

source: Trains the model on the supplied samples and labels.
es: Referencia de API para las clases en mlconjug.PyVerbiste.py
fr: Entraîne le modèle sur les échantillons et les étiquettes fournis.
it: Prepara il modello sui campioni e sulle etichette forniti.
pt: Treina o modelo nas amostras e rótulos fornecidos.
ro: Formează modelul pe eșantioanele și etichetele furnizate.

source: list. List of verbs.
fr: liste. Liste des verbes.
it: Predice la classe di coniugazione dell'elenco di verbi fornito.
pt: lista. Lista de verbos.
ro: Listă de șabloane de verb.

source: list. List of verb templates.
fr: liste.Liste des modèles de verbes.
pt: lista. Lista de modelos de verbos.

source: Predicts the conjugation class of the provided list of verbs.
fr: Prédit la classe de conjugaison de la liste de verbes fournie.
pt: Prevê a classe de conjugação da lista de verbos fornecida.
ro: Referință API pentru clasele din mlconjug.PyVerbiste.py

source: list. List of predicted conjugation groups.
fr: liste. Liste des groupes de conjugaison prédits.
it: Riferimento API per le classi in mlconjug.PyVerbiste.py
pt: lista. Lista de grupos de conjugação previstos.

source: API Reference for the classes in mlconjug.PyVerbiste.py
fr: Référence de l'API pour les classes dans mlconjug.PyVerbiste.py
pt: Referência de API para as classes em mlconjug.PyVerbiste.py

source: A Python library for conjugating verbs in French, English, Spanish, Italian, Portuguese and Romanian (more soon).
fr: Une bibliothèque Python pour conjuguer les verbes en français, anglais, espagnol, italien, portugais et roumain (plus rapidement).
it: Una libreria Python per coniugare i verbi in francese, inglese, spagnolo, italiano, portoghese e rumeno (più presto).
pt: Uma biblioteca Python para conjugar verbos em francês, inglês, espanhol, italiano, português e romeno (mais em breve).
ro: Acesta conține date de conjugare generate de modelele de învățare mecanică folosind librăria python mlconjug.

source: It contains conjugation data generated by machine learning models using the python library mlconjug.
fr: Il contient des données de conjugaison générées par des modèles d'apprentissage automatique utilisant la bibliothèque python mlconjug.
it: Contiene dati di coniugazione generati da modelli di apprendimento automatico che utilizzano la libreria python mlconjug.
pt: Ele contém dados de conjugação gerados por modelos de aprendizado de máquina usando a biblioteca python mlconjug.

source: More information about mlconjug at https://pypi.org/project/mlconjug/
fr: Plus d'informations sur mlconjug sur https://pypi.org/project/mlconjug/
it: Maggiori informazioni su mlconjug all'indirizzo https://pypi.org/project/mlconjug/
pt: Mais informações sobre mlconjug em https://pypi.org/project/mlconjug/
ro: Mai multe informații despre mlconjug la adresa https://pypi.org/project/mlconjug/

source: The conjugation data conforms to the XML schema defined by Verbiste.
es: Más información sobre Verbiste en https://perso.b2b2c.ca/~sarrazip/dev/verbiste.html
fr: Les données de conjugaison sont conformes au schéma XML défini par Verbiste.
it: I dati di coniugazione sono conformi allo schema XML definito da Verbiste.
pt: Os dados de conjugação estão em conformidade com o esquema XML definido pela Verbiste.
ro: Datele de conjugare sunt conforme cu schema XML definită de Verbiste.

source: More information on Verbiste at https://perso.b2b2c.ca/~sarrazip/dev/verbiste.html
fr: Plus d'informations sur Verbiste à https://perso.b2b2c.ca/~sarrazip/dev/verbiste.html
it: Maggiori informazioni su Verbiste su https://perso.b2b2c.ca/~sarrazip/dev/verbiste.html
pt: Mais informações sobre a Verbiste em https://perso.b2b2c.ca/~sarrazip/dev/verbiste.html
ro: Mai multe informații despre Verbiste la adresa https://perso.b2b2c.ca/~sarrazip/dev/verbiste.html

source: This is the class handling the Verbiste xml files.
es: cuerda.
fr: C'est la classe qui manipule les fichiers xml de Verbiste.
it: Questa è la classe che gestisce i file xml di Verbiste.
pt: Esta é a classe que manipula os arquivos xml da Verbiste.
ro: Aceasta este clasa care gestionează fișierele xml Verbiste.

source: string.
fr: chaîne.
it: stringa.
pt: corda.
ro: şir.

source: The language of the conjugator. The default value is fr for French.
es: Bases:: clase:` mlconjug.PyVerbiste.Verb`
fr: La langue du conjugateur La valeur par défaut est fr pour le français.
it: La lingua del coniugatore: il valore predefinito è fr per il francese.
pt: A linguagem do conjugador. O valor padrão é fr para francês.
ro: Limba conjugatorului. Valoarea implicită este fr pentru franceză.

source: The allowed values are: fr, en, es, it, pt, ro.
fr: Les valeurs autorisées sont: fr, en, es, it, pt, ro.
it: I valori consentiti sono: fr, en, es, it, pt, ro.
pt: Os valores permitidos são: fr, en, es, pt, ro.
ro: Încărcați și parse verbele din fișierul xml.

source: Load and parses the verbs from xml file.
fr: Charger et analyser les verbes du fichier XML.
it: Carica e analizza i verbi dal file xml.
pt: Carregue e analise os verbos do arquivo xml.

source: string or path object. Path to the verbs xml file.
fr: objet chaîne ou chemin Chemin d'accès au fichier xml des verbes.
it: oggetto stringa o percorso. Percorso del file xml verbi.
pt: string ou caminho do objeto. Caminho para o arquivo xml verbos.
ro: șir sau obiect cale. Calea spre fișierul xml verbale.

source: Parses XML file.
fr: FileObject. Fichier XML contenant les verbes.
it: FileObject. File XML contenente i verbi.
pt: Analisa o arquivo XML.
ro: Parsează fișierul XML.

source: OrderedDict. An OrderedDict containing the verb and its template for all verbs in the file.
fr: OrderedDict. Un OrderedDict contenant le verbe et son modèle pour tous les verbes dans le fichier.
it: OrderedDict. Un OrderedDict contenente il verbo e il suo modello per tutti i verbi nel file.
pt: OrderedDict. Um OrderedDict contendo o verbo e seu modelo para todos os verbos no arquivo.

source: Detects the allowed endings for verbs in the supported languages.
fr: Détecte les fins autorisées pour les verbes dans les langues prises en charge.
it: Rileva le terminazioni consentite per i verbi nelle lingue supportate.
pt: Detecta os finais permitidos para verbos nos idiomas suportados.
ro: Detectează terminațiile permise pentru verbe în limbile acceptate.

source: All the supported languages except for English restrict the form a verb can take.
fr: Toutes les langues prises en charge à l'exception de l'anglais limitent la forme qu'un verbe peut prendre.
it: Tutte le lingue supportate tranne l'inglese limitano il formato che un verbo può assumere.
pt: Todos os idiomas suportados, exceto o inglês, restringem a forma que um verbo pode receber.
ro: un set care conține terminațiile permise ale verbelor în limba țintă.

source: As English is much more productive and varied in the morphology of its verbs, any word is allowed as a verb.
fr: Comme l'anglais est beaucoup plus productif et varié dans la morphologie de ses verbes, n'importe quel mot est autorisé comme un verbe.
it: Poiché l'inglese è molto più produttivo e vario nella morfologia dei suoi verbi, ogni parola è consentita come un verbo.
pt: Como o inglês é muito mais produtivo e variado na morfologia de seus verbos, qualquer palavra é permitida como um verbo.
