Repository: Ars-Linguistica/mlconjug3
Catalog: docs/locale/*/LC_MESSAGES/modules.po
Languages: es, fr, it, pt, ro

source: set. A set containing the allowed endings of verbs in the target language.
fr: set. Un ensemble contenant les terminaisons autorisées des verbes dans la langue cible.
it: set. Un set contenente le terminazioni consentite di verbi nella lingua di destinazione.
pt: set. Um conjunto contendo as terminações permitidas de verbos no idioma de destino.

source: Checks if the verb is a valid verb in the given language.
fr: Vérifie si le verbe est un verbe valide dans la langue donnée.
it: Controlla se il verbo è un verbo valido nella lingua specificata.
pt: Verifica se o verbo é um verbo válido na língua dada.
ro: Verifică dacă verbul este un verb valabil în limba dată.

source: English words are always treated as possible verbs.
fr: Les mots anglais sont toujours traités comme des verbes possibles.
it: Le parole inglesi sono sempre trattate come possibili verbi.
pt: Palavras inglesas são sempre tratadas como verbos possíveis.
ro: Cuvintele în limba engleză sunt tratate întotdeauna ca verbe posibile.

source: Verbs in other languages are filtered by their endings.
fr: Les verbes dans d'autres langues sont filtrés par leurs fins.
it: I verbi in altre lingue sono filtrati dai loro finali.
pt: Verbos em outros idiomas são filtrados por seus finais.
ro: Verbe în alte limbi sunt filtrate după terminările lor.

source: string. The verb to conjugate.
fr: Chaîne: le verbe conjuguer.
it: stringa, il verbo coniugare.
pt: string. O verbo para conjugar.
ro: Verbul de a conjuga.

source: bool. True if the verb is a valid verb in the language. False otherwise.
fr: bool.Vrai si le verbe est un verbe valide dans la langue Faux sinon.
it: bool, vero se il verbo è un verbo valido nella lingua, altrimenti falso.
pt: bool. Verdadeiro se o verbo é um verbo válido na língua. Falso caso contrário.
ro: Încarcă și analizează conjugările din fișierul xml.

source: Load and parses the conjugations from xml file.
fr: Charger et analyser les conjugaisons à partir du fichier XML.
it: Carica e analizza le coniugazioni dal file xml.
pt: Carregue e analise as conjugações do arquivo xml.

source: string or path object. Path to the conjugation xml file.
fr: objet chaîne ou chemin Chemin d'accès au fichier xml de conjugaison.
it: oggetto stringa o percorso Percorso per il file xml di coniugazione.
pt: string ou caminho do objeto. Caminho para o arquivo xml de conjugação.
ro: șir sau obiect cale. Calea spre fișierul xml de conjugare.

source: FileObject. XML file containing the conjugation templates.
fr: FileObject Fichier XML contenant les modèles de conjugaison.
it: FileObject. File XML contenente i modelli di coniugazione.
pt: FileObject. Arquivo XML contendo os modelos de conjugação.
ro: FileObject, fișier XML care conține șabloanele de conjugare.

source: OrderedDict. An OrderedDict containing all the conjugation templates in the file.
fr: OrderedDict. Un OrderedDict contenant tous les modèles de conjugaison dans le fichier.
it: OrderedDict. Un OrderedDict contenente tutti i modelli di coniugazione nel file.
pt: OrderedDict. Um OrderedDict contendo todos os modelos de conjugação no arquivo.
ro: OrderedDict: Un ordin ordonat care conține toate șabloanele de conjugare din fișier.

source: Load and parses the inflected forms of the tense from xml file.
fr: Charger et analyser les formes fléchies du temps à partir du fichier xml.
it: Carica e analizza le forme flesse del tempo dal file xml.
pt: Carregue e analise os formulários flexionados do tempo do arquivo xml.
ro: Încarcă și analizează formele inflexionate ale timpului din fișierul xml.

source: string. The current tense being processed.
fr: chaîne: le temps courant en cours de traitement.
it: stringa. Il tempo corrente viene elaborato.
pt: string. O tempo atual sendo processado.
ro: Șirul. Timpul curent este procesat.

source: list. List of conjugated suffixes.
fr: liste. Liste des suffixes conjugués.
it: Ottiene informazioni sui verbi e restituisce un'istanza VerbInfo.
pt: lista. Lista de sufixos conjugados.
ro: Obține informații verbale și returnează o instanță VerbInfo.

source: Gets verb information and returns a VerbInfo instance.
fr: Obtient des informations de verbe et renvoie une instance VerbInfo.
pt: Obtém informações verbais e retorna uma instância VerbInfo.

source: VerbInfo object or None.
fr: Objet VerbInfo ou Aucun.
it: Oggetto VerbInfo o Nessuno.
pt: Objeto VerbInfo ou Nenhum.
ro: Obiect VerbInfo sau Nici unul.

source: Gets conjugation information corresponding to the given template.
fr: Obtient des informations de conjugaison correspondant au modèle donné.
it: Ottiene informazioni di coniugazione corrispondenti al modello specificato.
pt: Obtém informações de conjugação correspondentes ao modelo fornecido.
ro: Obține informații de conjugare corespunzătoare șablonului dat.

source: string. Name of the verb ending pattern.
fr: Chaîne Nom du modèle de fin de verbe.
it: string Nome del modello di fine del verbo.
pt: string. Nome do padrão final do verbo.
ro: șir. Numele verbului care se termină.

source: OrderedDict or None. OrderedDict containing the conjugated suffixes of the template.
fr: OrderedDict ou None OrderedDict contenant les suffixes conjugués du modèle.
it: OrderedDict o None. OrderedDict contenente i suffissi coniugati del modello.
pt: OrderedDict ou None. OrderedDict contendo os sufixos conjugados do template.
ro: OrdonatDict sau Nici unul. OrdonatDict care conține sufixele conjugate ale șablonului.

source: This class defines the Verbiste verb information structure.
fr: Cette classe définit la structure d'information du verbe Verbiste.
it: Questa classe definisce la struttura delle informazioni sui verbi del Verbese.
pt: Esta classe define a estrutura da informação verbal Verbiste.
ro: Această clasă definește structura de informații verbiste Verbiste.

source: string. Infinitive form of the verb.
fr: string. Racine lexicale du verbe.
it: Questa classe definisce l'oggetto Verb.
pt: string. Forma infinitiva do verbo.
ro: șir. Formă infinitivă a verbului.

source: This class defines the Verb Object.
fr: Cette classe définit l'objet verbal.
pt: Esta classe define o Objeto Verbo.

source: VerbInfo Object.
fr: Objet VerbInfo.
it: Oggetto VerbInfo.
pt: OrderedDict.

source: Populates the inflected forms of the verb.
fr: Remplit les formes fléchies du verbe.
it: Compila le forme flesse del verbo.
pt: Popula as formas flexionadas do verbo.
ro: Aceasta este versiunea generică a acestei metode.

source: This is the generic version of this method.
fr: Ceci est la version générique de cette méthode.
it: Questa è la versione generica di questo metodo.
pt: Esta é a versão genérica deste método.

source: It does not add personal pronouns to the conjugated forms.
fr: Il n'ajoute pas de pronoms personnels aux formes conjuguées.
it: Non aggiunge pronomi personali alle forme coniugate.
pt: Não acrescenta pronomes pessoais às formas conjugadas.
ro: Bazele:: clasa:" mlconjug.PyVerbiste.Verb`

source: This method can handle any new language if the conjugation structure conforms to the Verbiste XML Schema.
fr: Cette méthode peut gérer n'importe quel nouveau langage si la structure de conjugaison est conforme au schéma XML de Verbiste.
it: Questo metodo può gestire qualsiasi nuovo linguaggio se la struttura di coniugazione è conforme allo schema XML di Verbiste.
pt: Este método pode manipular qualquer novo idioma se a estrutura de conjugação estiver em conformidade com o Esquema XML da Verbiste.

source: This class defines the French Verb Object.
fr: Cette classe définit l'objet verbal français.
it: Questa classe definisce l'oggetto verbo francese.
pt: Esta classe define o Objeto Verbo Francês.
ro: Această clasă definește obiectul verbal francez.

source: Adds personal pronouns to the inflected verbs.
fr: Ajoute des pronoms personnels aux verbes fléchis.
it: Aggiunge pronomi personali ai verbi incurvati.
pt: Adiciona pronomes pessoais aos verbos flexionados.
ro: Adăugă pronume personale la verbele inflaționate.

source: This class defines the English Verb Object.
fr: Cette classe définit l'objet de verbe anglais.
it: Questa classe definisce l'oggetto verbo inglese.
pt: Esta classe define o Inglês Objeto Verbo.
ro: Această clasă definește Obiectul englez de verb.

source: This class defines the Spanish Verb Object.
fr: Cette classe définit l'objet verbal espagnol.
it: Questa classe definisce l'oggetto verbo spagnolo.
pt: Esta classe define o Objeto Verbo Espanhol.
ro: Această clasă definește Obiectul verbului spaniol.

source: This class defines the Italian Verb Object.
fr: Cette classe définit l'objet verbal italien.
it: Questa classe definisce l'oggetto Verb italiano.
pt: Esta classe define o Objeto Verbo Italiano.
ro: Această clasă definește obiectul verbului portughez.

source: This class defines the Portuguese Verb Object.
fr: Cette classe définit l'objet verbal portugais.
it: Questa classe definisce l'oggetto Verb Portoghese.
pt: Esta classe define o Objeto Verbo Português.

source: This class defines the Romanian Verb Object.
fr: Cette classe définit l'objet verbal roumain.
it: Questa classe definisce l'oggetto Verb Rumeno.
pt: Esta classe define o Objeto Verbo Romeno.

source: FileObject. XML file containing the verbs.
pt: FileObject. Arquivo XML contendo os verbos.
ro: OrderedDict Un ordin ordonat care conține verbul și șablonul său pentru toate verbele din fișier.

source: string. Lexical root of the verb.
pt: string. Raiz lexical do verbo.
ro: Obiectul VerbInfo.

source: Bases: :class:`sklearn.feature_extraction.text.CountVectorizer`
it: Basi:: class:` sklearn.feature_extraction.text.CountVectorizer`

source: Bases: :class:`mlconjug.PyVerbiste.Verb`
it: Basi:: classe:` mlconjug.PyVerbiste.Verb`

source: PyVerbiste.
es: Más información sobre mlconjug en https://pypi.org/project/mlconjug/
